# SelectionFailures Properties

---
The BuiltInFailuresSelectionFailures type exposes the following members.
| Name| Description
---|---|---
| NoElementSelected|  No element selected.
| NoValidElementSelected|  No valid element selected.
Top
#### Reference
BuiltInFailuresSelectionFailures Class
Autodesk.Revit.DB Namespace